Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes enum defines the different kind of input types for which a picker can be started.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes.None
Default, pick nothing.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes.Point
Pick any point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes.Segment
Pick a segment.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes.Face
Pick a face.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes.Object
Pick an object.